In [1]:
import pandas as pd
df = pd.read_csv("weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

XLS files are used to store data in table

In [2]:
df = pd.read_excel("weather_data.xlsx")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [3]:
df.to_csv("new_csv") # Creates a csv file with indexes

In [4]:
df.to_csv("new_no_index_csv",index= False) # Creates a csv file with no indexes

In [5]:
df = pd.read_csv("weather_data_cities - weather_data_cities.csv")
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

groupby -- This is a function that groups all the city names which are same in ordered manner.

In [6]:
g = df.groupby('city')

In [7]:
g # here city names are grouped according to alphabetical order of the city name

In [8]:
g.get_group('paris')

         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [9]:
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [10]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [11]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [12]:
import pandas as pd 
indian_weather = pd.DataFrame(
    {
        "city" : ['mumbai', 'delhi', 'bangalore'],
        "temperatures" : [10, 11, 15],
        "humidity" : [1, 2, 3],
    }
)
indian_weather

        city  temperatures  humidity
0     mumbai            10         1
1      delhi            11         2
2  bangalore            15         3

In [13]:
us_weather = pd.DataFrame(
    {
        'city' : ['Newyork', 'California', 'Sanfransisco'],
        'temperatures' : [3, 4, 5],
        'humidity' : [4,5,6],
    }
)
us_weather

           city  temperatures  humidity
0       Newyork             3         4
1    California             4         5
2  Sanfransisco             5         6

In [14]:
total_weather = pd.concat([us_weather,indian_weather], ignore_index=True)

In [15]:
total_weather

           city  temperatures  humidity
0       Newyork             3         4
1    California             4         5
2  Sanfransisco             5         6
3        mumbai            10         1
4         delhi            11         2
5     bangalore            15         3

In [16]:
total_weather_2 = pd.concat([us_weather,indian_weather],axis= 1)

In [18]:
total_weather_2 # Instead of concating both tables we are joining them side by side.

           city  temperatures  humidity       city  temperatures  humidity
0       Newyork             3         4     mumbai            10         1
1    California             4         5      delhi            11         2
2  Sanfransisco             5         6  bangalore            15         3

In [19]:
temperature_df = pd.DataFrame(
    {
        "city" : ['mumbai', 'delhi', 'hyderabad', 'bangalore'],
        "temperatures" : [12, 23, 34, 45,]
    }
)
temperature_df

        city  temperatures
0     mumbai            12
1      delhi            23
2  hyderabad            34
3  bangalore            45

In [20]:
humidity_df = pd.DataFrame(
    {
        "city" : ['mumbai', 'delhi', 'hyderabad', 'bangalore'],
        "humidity" : [56,67,78,89]
    }
)
humidity_df

        city  humidity
0     mumbai        56
1      delhi        67
2  hyderabad        78
3  bangalore        89

In [25]:
total_df = pd.merge(temperature_df, humidity_df, on='city')

In [26]:
total_df

        city  temperatures  humidity
0     mumbai            12        56
1      delhi            23        67
2  hyderabad            34        78
3  bangalore            45        89

In [28]:
total_df_2 = pd.merge(temperature_df, humidity_df, on='city')

In [29]:
total_df_2

        city  temperatures  humidity
0     mumbai            12        56
1      delhi            23        67
2  hyderabad            34        78
3  bangalore            45        89

In [30]:
# Outer-Join
total_df_3 = pd.merge(temperature_df, humidity_df, on='city',how = 'outer')

In [32]:
total_df_3 # here all cities are included

        city  temperatures  humidity
0     mumbai            12        56
1      delhi            23        67
2  hyderabad            34        78
3  bangalore            45        89

In [33]:
Index_1 = pd.DataFrame([1,2,3,4,5,6,7,8,9])
Index_1

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8
8  9

In [35]:
Index_2 = pd.DataFrame([1,2,3,4,5,6,7,8,9],index = [9,8,7,6,5,4,3,2,1])
Index_2 # Here we mentioned what must be the indexes of the data frame

   0
9  1
8  2
7  3
6  4
5  5
4  6
3  7
2  8
1  9

In [36]:
Index_2.loc[4]

0    6
Name: 4, dtype: int64

In [37]:
Index_2.iloc[3]

0    4
Name: 6, dtype: int64

In [38]:
Index_2.loc[:5]

   0
9  1
8  2
7  3
6  4
5  5

In [39]:
Index_2.iloc[:5]

   0
9  1
8  2
7  3
6  4
5  5